session_3/blogspot/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "tags", "topic", "content", "created_at", "updated_at", "user_id", "public") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "Lorem Ipsum is the best"], ["updated_at", "2021-02-15 09:35:04.347389"], ["id", 1]]