session_3/blogspot/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ?, "admin" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$t0WqePUfpOE9Vkrcie5AiuoznKO0z2Gp90N.BYZGVHWnQMzxd/pDy"], ["updated_at", "2021-02-16 12:58:19.053219"], ["admin", 1], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)